---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupportLandingsupportType
source: html/aa77abb8-9fdd-1207-0f3d-498a21fdbd1f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupportLandingsupportType Property

"Landing Support Type": Landing Support Type

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupportLandingsupportType { get; }
```